"""
数据类型	    有序性	     重复元素规则	      可变性	    索引访问	    切片操作	          典型使用场景
字符串（str）	有序	         允许重复	          不可变	    支持	        支持	            文本处理、字符序列操作
列表（list）	有序	         允许重复	          可变	    支持	        支持	            有序可重复数据集合
元组（tuple）	有序	         允许重复	          不可变	    支持	        支持	            固定数据记录、常量集合
集合（set）	无序	         不允许重复	      可变	    不支持	    不支持	        数据去重、集合逻辑运算
字典（dict）	有序          key不允许重复	 可变	    不支持	    不支持	         键值对映射、结构化数据存储
                         value 允许重复
"""